<template>
  <div class="textArea">
    <div class="textArea__div" contenteditable="true" ref="editor">
      <p class="defaultTextP">
        Таким образом консультация с широким активом представляет собой
        интересный эксперимент проверки позиций, занимаемых участниками в
        отношении поставленных задач. С другой стороны постоянное
        информационно-пропагандистское обеспечение нашей деятельности
        представляет собой интересный эксперимент проверки форм развития.
        Идейные соображения высшего порядка, а также укрепление и развитие
        структуры влечет за собой процесс внедрения и модернизации
        соответствующий условий активизации. Задача организации, в особенности
        же реализация намеченных плановых заданий играет важную роль в
        формировании дальнейших направлений развития. Повседневная практика
        показывает, что постоянное информационно-пропагандистское обеспечение
        нашей деятельности играет важную роль в формировании существенных
        финансовых и административных условий.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'TextArea',
  data() {
    return { content: '' };
  },
  methods: {},
};
</script>

<style lang="scss" scoped>
.textArea {
  margin-top: 38px;
}
.textArea__div {
  width: 100%;
  background-color: #1e1e1e;
  width: 100%;
  color: #fff;
  // border: 1px solid white;
}
</style>
